app/controllers/listings_controller.rb

  def index
    @listings = Listing.search params[:search], :page => params[:page], :per_page=>2, :order=> params[:order],
    :field_weights=> { :title=> 20, :description=>10 }
---
SELECT * FROM `listings`

  def show
    @listing = Listing.find(params[:id])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 1)

  def edit
    @listing = Listing.find(params[:id])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 2)

  def create
    @listing = Listing.new(params[:listing])

    respond_to do |format|
      if @listing.save
---
INSERT INTO `listings` (`updated_at`, `title`, `description`, `created_at`) VALUES('2010-07-30 12:08:01', 'dog', 'he is good', '2010-07-30 12:08:01')

  def update
    @listing = Listing.find(params[:id])

    respond_to do |format|
      if @listing.update_attributes(params[:listing])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 2)
UPDATE `listings` SET `title` = 'cat', `description` = 'this cat is bad', `updated_at` = '2010-08-01 15:07:18' WHERE `id` = 2